Repository: SCVApp/SCVAppFlutter
Catalog: lib/l10n/app_*.arb
Languages: sl

# welcome
source: Welcome to ŠCVApp!
sl: Dobrodošel/a v aplikaciji ŠCVApp!

source: Home
sl: Domov

source: Meals
sl: Malice

source: Schedule
sl: Urnik

source: Settings
sl: Nastavitve

# prompt_logout
source: Are you sure you want to log out?
sl: Ali si prepričan/a, da se želiš odjaviti?

# device_no_settings_for_security
source: You have no security settings set on your phone. Therefore, it is not possible to unlock the app.
sl: V telefonu nimaš nastavljenih varnostnih nastavitev. Zato ni možno odkleniti aplikacije.

source: Yes
sl: Da

source: No
sl: Ne

source: Warning!
sl: Opozorilo!

# now_on_schedule
source: Currently on schedule
sl: Trenutno na urniku

# end_of_schedule
source: end of school
sl: konca pouka

# schedule_other_days
source: View schedule for other days
sl: Ogled urnika za ostale dni

source: unlock_door_available
sl: ODKLEP VRAT JE NA VOLJO

# logout_popup
source: Are you sure you want to log out of the SchoolCVApp?
sl: Si prepričan/a, da se želiš odjaviti iz aplikacije ŠCVApp?

source: Cancel
sl: Prekliči

source: Logout
sl: Odjava

source: No, cancel
sl: Ne, prekliči

# confirm_logout
source: Yes, log me out.
sl: Da, odjavi me.

source: Authorization
sl: Avtorizacija

# pick
source: Select
sl: Izberi

source: Error
sl: Napaka

source: Open settings
sl: Odpri nastavitve

source: Available themes:
sl: Teme na voljo:

source: Light
sl: Svetla

source: Dark
sl: Temna

source: System
sl: Sistemska

# selected_date
source: Date selected:
sl: Izbran datum:

# selected_meal
source: SELECTED MEAL FOR TODAY
sl: IZBRANA MALICA ZA DANES

# no_meal
source: No lunch today.
sl: Danes ni malice.

# no_meal_for_today
source: No lunch for today.
sl: Za danes ni malice.

source: Light theme
sl: Svetla tema

source: Dark theme
sl: Temna tema

# system_theme
source: System
sl: Sistemsko

# instant_lock
source: Immediately
sl: Takoj

# one_minute
source: 1 minute
sl: 1 minuta

# five_or_more_minutes
source: minutes
sl: minut

# turned_on
source: On
sl: Vklopljeno

# turned_off
source: Off
sl: Izklopljeno

# login_with_biometrics
source: Login with biometric security
sl: Prijavi se z biometrično varnostjo

# error_status_load
source: Error changing status
sl: Napaka pri spremembi statusa

# error_refresh_data
source: Error refreshing data!
sl: Napaka pri osveževanju podatkov!

# error_save_data
source: Error saving data!
sl: Napaka pri shranjevanju podatkov!

# pick_theme
source: Pick a theme
sl: Izberi temo

# about_biometrics
source: By enabling this setting, you can then enter the app via biometrics (facial recognition or Face ID, fingerprint recognition or Touch ID, and your phone's PIN or password). If you don't have any of these on your phone, the app will warn you to add at least one of the security conditions listed above.
sl: Z omogočanjem te nastavitve lahko nato v aplikacijo vstopiš preko biometričnih podatkov (prepoznava obraza ali Face ID, prepoznava prstnega odtisa ali Touch ID ter PIN ali geslo telefona). V primeru, da na telefonu nimaš nič od navedenega, te aplikacija opozori, da dodaš vsaj en varnostni pogoj, naveden zgoraj.

# lock_app
source: Lock the app in the background after
sl: Zaklep aplikacije v ozadju po

source: Biometric unlock
sl: Biometrično odklepanje

# no_biometrics
source: You have no security settings set on your phone, so it is not possible to change the biometric unlock setting.
sl: V telefonu nimaš nastavljenih varnostnih nastavitev, zato ni možno spremeniti nastavitve biometričnega odklepanja.

source: info
sl: informacije

source: Available
sl: Dosegljiv/-a

# away
source: Absent
sl: Odsoten/-a

# brb
source: I'll be right back
sl: Takoj bom nazaj

source: Busy
sl: Zaseden/-a

# dnd
source: Do not disturb
sl: Ne moti

# offline
source: Unreachable
sl: Nedosegljiv/-a

# pick_status
source: Select the displayed status:
sl: Izberi prikazan status:

source: Change status
sl: Spremeni status

source: Other tools
sl: Ostala orodja

# school_tools
source: Tools for school
sl: Orodja za šolo

source: App look
sl: Izgled aplikacije

# about_scvapp
source: About the app
sl: O ŠCVApp

# about_app
source: App details
sl: Podatki o aplikaciji

source: Account
sl: Račun

# logout_app
source: Logout from the application
sl: Odjava iz aplikacije

# about_app_desc
source: The ŠCVApp is designed for students and teachers of the Velenje School Centre. It was created by Urban Krepel and Blaž Osredkar. The app contains the following tools: • access to the brunch registration system, • the timetable for the class attended, • quick access to the school's homepage, • online access to the eAssistant app, and some useful shortcuts to the school account settings. We will continue to add more useful tools to the app. For any questions or comments, please contact info.app@scv.si.
sl: Aplikacija ŠCVApp je namenjena dijakom in učiteljem Šolskega centra Velenje. Ustvarila sta jo Urban Krepel in Blaž Osredkar. Aplikacija vsebuje naslednja orodja: • dostop do sistema prijave na kosilo, • urnik za obiskani razred, • hiter dostop do domače strani šole, • spletni dostop do aplikacije eAsistent, • in nekaj uporabnih bližnjic do nastavitev šolskega računa. Aplikaciji bomo še naprej dodajali več uporabnih orodij. Za vsa vprašanja ali pripombe se obrnite na info.app@scv.si.

source: Useful links
sl: Uporabne povezave

source: All rights reserved.
sl: Vse pravice pridržane.

source: Web page
sl: Spletni portal

source: User guide
sl: Navodila za uporabo

source: Click here
sl: Klikni tukaj

source: Privacy Policy
sl: Pravilnik o zasebnosti

# coming_soon
source: Available soon
sl: Kmalu na voljo

# door_unlock_success
source: Door unlocked successfully
sl: Vrata so uspešno odklenjena

# door_no_class_hour
source: You currently have no classes in this classroom
sl: Trenutno nimaš pouka v tej učilnici

# door_wait_unlock
source: Please wait for the door to unlock again
sl: Prosim počakaj za ponovno odklepanje vrat

# door_classroom_nonexistent
source: Classroom does not exist
sl: Učilnica ne obstaja

# door_locked
source: The door is locked
sl: Vrata so zaklenjena

# door_unlock_unsuccessful
source: The door was not opened
sl: Vrata niso bila odprta

# door_unlock_limit_reached
source: You have reached the limit of unlocks. Please try again later.
sl: Presegel/a si število dovoljenih odklepov vrat. Prosim, počakaj nekaj časa.

# door_press_lock
source: Press the lock to unlock the door
sl: Pritisni ključavnico za odklep vrat

source: Unknown error.
sl: Neznana napaka.

# try_again
source: Please try again
sl: Prosim, poskusi ponovno

# try_again_r
source: Try again
sl: poskusi znova.

# door_max_unlocks
source: Watch out, you're unlocking too fast!
sl: Pazi, prehitro odklepaš!

# door_click_lock
source: Press the lock to unlock the door
sl: Pritisni ključavnico za odklep vrat

# door_not_found
source: Door not found. Please try again. If the problem persists, please contact your application administrator.
sl: Vrata niso bila najdena. Prosim, poskusi znova. Če težava ni odpravljena, se obrni na skrbnika aplikacije.

# something_went_wrong
source: An error has occurred. Please try again
sl: Prišlo je do napake. Prosim, poskusi znova

# todays_class_hours
source: Today's schedule
sl: Današnji urnik

source: Date
sl: Datum

# profesor
source: Professor
sl: Profesor

source: Classroom
sl: Učilnica

# start_of_class_hour
source: Start of class at
sl: Začetek pouka ob

# next_hour
source: next class
sl: naslednje ure

# end_of_class_hours
source: End of class
sl: Konec pouka

source: No class
sl: Ni pouka

# error_no_security_features
source: You do not have security settings set on your phone, so the app cannot be unlocked.
sl: V telefonu nimaš nastavljenih varnostnih nastavitev, zaradi tega ni možno odkleniti aplikacije.

# login_scvapp
source: Login to the SCVApp
sl: Prijava v aplikacijo ŠCVApp

source: Email
sl: E-pošta

# email_shape
source: The email address is in the form ime.priimek@scv.si
sl: E-poštni naslov je v obliki ime.priimek@scv.si

source: Password
sl: Geslo

# password_info
source: Password for access to snacks
sl: Geslo za dostop do malic

# all_tools_one_place
source: All tools in one place.
sl: Vsa orodja na enem mestu.

# tools_description
source: Tools for students, all in one place.
sl: Dijakom koristna orodja, zbrana na enem mestu.

source: Simple and safe
sl: Preprosto in varno

# login_microsoft_description
source: Log in with your school account to access all the features of the ŠCVApp.
sl: Za dostop do vseh funkcij aplikacije ŠCVApp se prijavi s šolskim računom.

source: Login
sl: Prijava

source: Skip
sl: Preskoči

# error_login
source: Login error. Please try again.
sl: Napaka pri prijavi. Prosim, poskusi ponovno.

# error_login_witout_try
source: An error has occurred.
sl: Napaka pri prijavi.

# wait_login
source: Please wait, login is in progress...
sl: Prosim počakaj, prijava poteka...

source: Selected classroom:
sl: Izbrana učilnica:

# no_biometrics_when_unlock
source: You have not set any security settings on your phone, so it is not possible to change the biometric unlock setting.
sl: V telefonu nimaš nastavljenih varnostnih nastavitev, zato ni možno odkleniti aplikacije.

source: Light mode
sl: Svetli način

source: Dark mode
sl: Temni način

# school_break
source: Break until
sl: Odmor do

source: until
sl: do

source: and
sl: in

# all_tools_one_place_title
source: All tools in one place.
sl: Vsa orodja na enem mestu.

# simple_and_safe_title
source: Simple and safe
sl: Preprosto in varno

# meals_login
source: Login to meals
sl: Prijava v malice

# meals_auto_login
source: Automatic login
sl: Samodejna prijava

source: Lockers
sl: Omarice

# lockers_description
source: Lockers for storing things
sl: Omarice za shranjevanje stvari

source: Locker
sl: Omarica

# your_locker_is_in_use
source: Your locker is currently in use.
sl: Vaša omarica je trenutno v uporabi.

source: End locker use
sl: Končaj uporabo in odprite omarico

# open_locker
source: Just open the locker
sl: Samo odpri omarico

# reserve_locker
source: Reserve and open the locker
sl: Rezerviraj in odpri omarico

# start_locker_use
source: Do you want to start using the locker?
sl: Želite začeti uporabljati to omarico?

source: Nothing
sl: Nič

# locker_not_found
source: Locker not found. Please try again. If the problem persists, please contact your application administrator.
sl: Omarica ni bila najdena. Prosim, poskusi znova. Če težava ni odpravljena, se obrni na skrbnika aplikacije.

# not_using_locker
source: You are not using this locker.
sl: Te omarice ne uporabljaš.

# locker_in_use
source: The locker is already in use
sl: Omarica je v že uporabi

# locker_limit_reached
source: You already using 2 lockers. To use this locker, you must first end the use of one of them.
sl: Že imaš 2 omarici v uporabi. Za uporabo te omarice moraš najprej končati uporabo ene od njiju.

# failed_to_open_locker
source: The locker could not be opened. Please try again. If the problem persists, please contact your application administrator.
sl: Omarice ni bilo mogoče odpreti. Prosim, poskusi znova. Če težava ni odpravljena, se obrni na skrbnika aplikacije.

# locker_opened
source: The locker has been successfully opened
sl: Omarica je bila uspešno odprta

# locker_returned
source: The locker has been successfully returned
sl: Omarica je uspešno odprta in vrnjena.

source: Free lockers
sl: Proste omarice

# save_bottom_menu_popup
source: Do you want to save the changes? If you save them, the app will restart.
sl: Želite shraniti spremembe? Če jih shranite, se bo aplikacija ponovno zagnala.

source: Saved
sl: Shranjeno

# click_open_app
source: Click to open the app
sl: Kliknite, da odprete aplikacijo

source: Bottom menu settings
sl: Nastavitve spodnjega menija

source: Bottom menu
sl: Spodnji meni

source: More
sl: Več

source: Menu
sl: Meni

# edit_bottom_menu
source: Edit your bottom menu
sl: Uredi si spodnji meni
